<?php
if (!defined('__TYPECHO_ROOT_DIR__')) exit;

function themeConfig($form) {
    $logoUrl = new Typecho_Widget_Helper_Form_Element_Text('logoUrl', NULL, NULL, _t('站点 LOGO 地址'), _t('在这里填入一个图片 URL 地址, 以在网站标题前加上一个 LOGO'));
    $form->addInput($logoUrl);
    
    $sidebarBlock = new Typecho_Widget_Helper_Form_Element_Checkbox('sidebarBlock', 
    array('ShowRecentPosts' => _t('显示最新文章'),
    'ShowRecentComments' => _t('显示最近回复'),
    'ShowCategory' => _t('显示分类'),
    'ShowArchive' => _t('显示归档'),
    'ShowOther' => _t('显示其它杂项')),
    array('ShowRecentPosts', 'ShowRecentComments', 'ShowCategory', 'ShowArchive', 'ShowOther'), _t('侧边栏显示'));
    
    $form->addInput($sidebarBlock->multiMode());
}

function themeInit($archive) {
    $archive->parameter->pageSize = 48; // 自定义条数
}

/*
function themeFields($layout) {
    $logoUrl = new Typecho_Widget_Helper_Form_Element_Text('logoUrl', NULL, NULL, _t('站点LOGO地址'), _t('在这里填入一个图片URL地址, 以在网站标题前加上一个LOGO'));
    $layout->addItem($logoUrl);
}
*/




function getIntTag()
{
   return $arr = [
       // "1339" =>"胖哥试车", 
        "1340"=>"爱路客",
        "1341"=>"吴佩",
        // "1342"=>"五号车论",
        // "1343"=>"玩车TV",
        // "1344"=>"踢车帮",
        // "1345"=>"夏东评车",
        // "1346"=>"车文字T",
        "1347"=>"老司机",
        "1348"=>"新手",
        "1349"=>"女司机",
        "1350"=>"超级试驾",
        // "1351"=>"小仓说车",
        // "1352"=>"小仓帮选车",
        // "1353"=>"夏说",
        // "1354"=>"晓敏AUTO",
        "1355"=>"萝卜报告",
        "1356"=>"震震有词",
        "1357"=>"越野路书",
        // "1358"=>"38号车评中心",
        "1359"=>"驾驶讲堂",
        // "1360"=>"38侃车",
        // "1361"=>"汽车洋葱圈",
        "1362"=>"跟我视驾",
        "1363"=>"太平洋汽车",
        // "1364"=>"大家车言论",
        // "1365"=>"ASKYYP",
        // "1366"=>"YYP",
        "1367"=>"袁启聪",
        "1368"=>"曾颖卓",
        // "1369"=>"新车评",
        "1370"=>"凹凸用车",
        "1371"=>"原来是这样",
        "1372"=>"玩车教授",
        "1373"=>"暴走汽车",
        // "1374"=>"兮有视频",
        // "1375"=>"神经兮兮车评记",
        // "1376"=>"汽车百科姐说",
        "1377"=>"汽车天涯",
        "1378"=>"AL频道",
        "1379"=>"智选车",
        // "1380"=>"爽爽侃车",
        "1381"=>"早安汽车",
        "1382"=>"车比得",
        // "1383"=>"李老鼠说车",
        // "1384"=>"二手车",
        // "1385"=>"30秒懂车",
        // "1386"=>"Y车评",
        "1387"=>"集车",
        "1388"=>"闫闯说车",
        "1389"=>"逗斗车",
        "1390"=>"车评家",
        // "1391"=>"四万说车",
        "1392"=>"毒舌汽车",
        "1393"=>"车若初见",
        "1394"=>"拆车坊",
        "1395"=>"易车",
        "1396"=>"星哥侃车",
        // "1397"=>"一辆ACarTV",
        "1398"=>"海阔试车",
        // "1399"=>"杀手公开课",
        "1400"=>"TopDiao",
        "1401"=>"爱极客",
        "1402"=>"扯扯车",
        "1403"=>"购车300秒",
        // "1404"=>"咻咻车",
        "1405"=>"车少话车",
        // "1406"=>"Goingworld",
        "1407"=>"爱车的诺诺",
        "1408"=>"车扯",
        "1409"=>"白话汽车",
        "1410"=>"驭动汽车",
        "1411"=>"汽车娱乐星球",
        "1412"=>"这车值么",
        "1413"=>"Ray哥侃车",
        // "1414"=>"网易汽车",
        "1415"=>"CarSee",
        "1416"=>"海川品车",
        "1417"=>"蜗牛车志",
        "1418"=>"新出行",
        // "1419"=>"新能源汽车",
        // "1420"=>"车论帮之叫兽",
        "1421"=>"叫兽论车",
        // "1422"=>"车论帮",
        "1423"=>"集视家",
        "1424"=>"啊车视频",
        // "1425"=>"涡轮时间",
        // "1426"=>"车闻社",
        // "1427"=>"汽车导购杂志社",
        // "1428"=>"66车讯",
        "1429"=>"驾驭制造者",
        "1430"=>"主试角",
        // "1431"=>"涓子",
        // "1432"=>"初晓敏",
        // "1433"=>"车展",
        // "1434"=>"广州车展",
        // "1435"=>"北京车展",
        // "1436"=>"成都车展",
        // "1437"=>"上海车展",
        // "1438"=>"北美车展",
        // "1439"=>"美女",
        // "1440"=>"法兰克福车展",
        // "1441"=>"东京车展",
        // "1442"=>"底特律车展",
        // "1443"=>"日内瓦车展",
        // "1444"=>"巴黎车展",
        // "1445"=>"车模",
        // "1446"=>"电动汽车",
        "1447"=>"ams车评网",
        // "1448"=>"微型车",
        // "1449"=>"紧凑型",
        // "1450"=>"中型车",
        // "1451"=>"大型车",
        // "1452"=>"豪华车",
        // "1453"=>"SUV",
        // "1454"=>"MPV",
        // "1455"=>"跑车",
        // "1456"=>"旅行车",
        "1457"=>"新能源",
        // "1458"=>"两厢车",
        // "1459"=>"三厢车",
        "1460"=>"掀背车",
        // "1461"=>"敞篷车",
        // "1462"=>"面包车",
        // "1463"=>"小型SUV",
        "1464"=>"皮卡",
        // "1465"=>"微面",
        // "1466"=>"紧凑型SUV",
        // "1467"=>"中型SUV",
        // "1468"=>"中大型SUV",
        // "1469"=>"大型SUV",
        "1470"=>"对比",
        // "1471"=>"新车",
        // "1472"=>"胖哥",
        // "1473"=>"38",
        // "1474"=>"陈震",
        // "1475"=>"闫闯",
        // "1476"=>"张小娴",
        // "1477"=>"王茜麟",
        // "1478"=>"38车评中心",
        "1480"=>"汽车棒棒堂",
        // "1481"=>"优酷汽车脱口秀夏说",
        "1482"=>"麻辣车事",
        "1483"=>"车市进言",
        "1484"=>"网上车市",
        "1485"=>"视知车学院",
        "1486"=>"老司机",
        "1487"=>"新浪汽车",
        "1488"=>"爱车兵团",
        "1489"=>"一和一",
        "1490"=>"优酷汽车",
        "1491"=>"五号频道",
        "1492"=>"豆哥不卖车",
        // "1493"=>"吴佩频道",
        // "1494"=>"胖哥汽车",
        // "1495"=>"毒蛇汽车",
        "1496"=>"车图腾",
        // "1497"=>"胖哥汽车频道",
        "1418"=>"新出行",
        "1499"=>"0991车评中心",
        "1500"=>"车世界视频",
        "1501"=>"好购汽车",
        "1502"=>"锤哥试车",
        // "1503"=>"开车去非洲",
        "1504"=>"autov汽车生活网",
        "1505"=>"牛车网",
        "1506"=>"车生活",
        "1507"=>"Gran车驭",
        // "1508"=>"车映讯",
        "1509"=>"EK爱车人说"

    ];
}

function navList()
{
    return $arr = [
        // ['tag' => "EK爱车人说",'id' => "1509"],
        ['tag' => "Y车评",'id' => "1386"],
        ['tag' => "Goingworld",'id' => "1406"],
        ['tag' => "车比得",'id' => "1382"],
        ['tag' =>  "美女",'id' => '1439'],
        ['tag' =>  "初晓敏",'id' => '1432'],
        ['tag' =>  "爽爽侃车",'id' => '1380'],
        ['tag' =>  "30秒懂车",'id' => '1385'],
        ['tag' =>  "车映讯",'id' => '1508']

    ];
}
//车评
function Cheping(){
   
   return [
        "1369"=>"新车评",
        "1364"=>"大家车言论",
        "1383"=>"李老鼠说车",
        "1478"=>"38号车评中心",
        "1339" =>"胖哥试车",
        "1343"=>"玩车TV",
        "1344"=>"踢车帮",
        "1345"=>"夏东评车",
        "1379"=>"智选车",
        // "1346"=>"车文字T",
        // "1361"=>"汽车洋葱圈",
        // "1362"=>"跟我视驾",
        // "1363"=>"太平洋汽车",
        "1386"=>"Y车评",
        // "1425"=>"涡轮时间",
        // "1426"=>"车闻社",
        // "1508"=>"车映讯",
        // "1509"=>"EK爱车人说",
        // "1373"=>"暴走汽车"
   ];
}
//车新闻
function carNews()
{
   return [
        "1371"=>"原来是这样",
        "1403"=>"购车300秒",
        "1381"=>"早安汽车"
   ];
}
//美女
function meiv()
{
    return [
        "1439"=>"美女",
        "1431"=>"涓子",
        "1375"=>"兮兮",
        "1432"=>"初晓敏",
        "1476"=>"张小娴",
        "1445"=>"车模",
        "1376"=>"百科姐",
        "1351"=>"小仓说车",      
        "1380"=>"爽爽侃车",
    ];
    
}

function carType()
{
   return [
    "1455"=>"跑车",
    "1461"=>"敞篷车",
    "1449"=>"紧凑型",
    "1458"=>"两厢车",
    "1459"=>"三厢车",
    "1453"=>"SUV",
    "1452"=>"豪华车",
    // "1448"=>"微型车",
    // "1450"=>"中型车",
    // "1451"=>"大型车",
    "1454"=>"MPV",
    "1456"=>"旅行车",
    // "1457"=>"新能源",
    // "1460"=>"掀背车",
    // "1462"=>"面包车",
    // "1463"=>"小型SUV",
    // "1464"=>"皮卡",
    // "1465"=>"微面",
    // "1466"=>"紧凑型SUV",
    // "1467"=>"中型SUV",
    // "1468"=>"中大型SUV",
    // "1469"=>"大型SUV",
   ];
}

//汽车脱口秀
function talkShow()
{
    return [
        "1353"=>"夏说",
        "1354"=>"晓敏AUTO",
        "1391"=>"四万说车",
        "1356"=>"震震有词",
        // "1360"=>"38侃车",
    ];
}

//汽车旅行
function carTravel()
{
    return [
        "1503"=>"开车去非洲",
        "1406"=>"Goingworld",
        "1397"=>"一辆ACarTV",
    ];
}

//安全驾驶
function safeDriving()
{
    
}

//车展
function carShow($value='')
{
    return [
        "1433"=>"车展",
        "1434"=>"广州车展",
        "1435"=>"北京车展",
        "1436"=>"成都车展",
        "1437"=>"上海车展",
        "1438"=>"北美车展",
        "1440"=>"法兰克福车展",
        "1441"=>"东京车展",
        "1442"=>"底特律车展",
        "1443"=>"日内瓦车展",
        "1444"=>"巴黎车展",
        "1445"=>"车模"
    ];
}
//养车用车
function YCYC($value='')
{
    return [

        "1370"=>"凹凸用车",


    ];
}

